###################################################################

# Created by write_sdc on Mon May  8 14:05:09 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_delay 25  -to [get_ports {alucontrol[6]}]
set_max_delay 25  -to [get_ports {alucontrol[5]}]
set_max_delay 25  -to [get_ports {alucontrol[4]}]
set_max_delay 25  -to [get_ports {alucontrol[3]}]
set_max_delay 25  -to [get_ports {alucontrol[2]}]
set_max_delay 25  -to [get_ports {alucontrol[1]}]
set_max_delay 25  -to [get_ports {alucontrol[0]}]
set_load 0.000584972  [get_nets n23]
set_load 0.000673738  [get_nets n3]
set_load 0.00346076  [get_nets n7]
set_load 0.000622044  [get_nets n22]
set_load 0.00131911  [get_nets n21]
set_load 0.00132232  [get_nets n6]
set_load 0.00165483  [get_nets n20]
set_load 0.00137614  [get_nets n5]
set_load 0.0013017  [get_nets n15]
set_load 0.00145102  [get_nets n4]
set_load 0.00143976  [get_nets n10]
set_load 0.000207833  [get_nets n2]
set_load 0.0014516  [get_nets n17]
set_load 0.000737262  [get_nets n8]
set_load 0.000617968  [get_nets n19]
set_load 0.00282311  [get_nets n14]
set_load 0.00134956  [get_nets n18]
set_load 0.00077671  [get_nets n16]
set_load 0.00248451  [get_nets n13]
set_load 0.000757504  [get_nets n12]
set_load 0.000226354  [get_nets n11]
set_load 0.00164141  [get_nets n9]
set_load 0.000205007  [get_nets n1]
set_load 0.0016905  [get_nets {alucontrol[6]}]
set_load 0.00287198  [get_nets {alucontrol[5]}]
set_load 0.00172166  [get_nets {alucontrol[4]}]
set_load 0.00223699  [get_nets {alucontrol[3]}]
set_load 0.00108874  [get_nets {alucontrol[2]}]
set_load 0.00213088  [get_nets {alucontrol[1]}]
set_load 0.000602396  [get_nets {alucontrol[0]}]
set_load 0.000947925  [get_nets {funct[5]}]
set_load 0.000838732  [get_nets {funct[4]}]
set_load 0.000798332  [get_nets {funct[3]}]
set_load 0.00461301  [get_nets {funct[2]}]
set_load 0.00138161  [get_nets {funct[1]}]
set_load 0.00374283  [get_nets {funct[0]}]
set_load 0.00159054  [get_nets {aluop[1]}]
set_load 0.00280966  [get_nets {aluop[0]}]
