###################################################################

# Created by write_sdc on Tue Feb 28 14:52:56 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_delay 25  -to [get_ports {op[6]}]
set_max_delay 25  -to [get_ports {op[5]}]
set_max_delay 25  -to [get_ports {op[4]}]
set_max_delay 25  -to [get_ports {op[3]}]
set_max_delay 25  -to [get_ports {op[2]}]
set_max_delay 25  -to [get_ports {op[1]}]
set_max_delay 25  -to [get_ports {op[0]}]
set_load 0.000330616  [get_nets n26]
set_load 0.000710831  [get_nets n25]
set_load 0.00155757  [get_nets n11]
set_load 0.00260772  [get_nets n15]
set_load 0.00347498  [get_nets n6]
set_load 0.00106972  [get_nets n19]
set_load 0.000923525  [get_nets n23]
set_load 0.00145059  [get_nets n24]
set_load 0.0029144  [get_nets n22]
set_load 0.000588943  [get_nets n20]
set_load 0.000741815  [get_nets n4]
set_load 0.000628399  [get_nets n21]
set_load 0.00225203  [get_nets n2]
set_load 0.00205117  [get_nets n16]
set_load 0.00183586  [get_nets n7]
set_load 0.00233378  [get_nets n18]
set_load 0.000795805  [get_nets n14]
set_load 0.000395478  [get_nets n17]
set_load 0.00153766  [get_nets n5]
set_load 0.00127788  [get_nets n13]
set_load 0.000938304  [get_nets n12]
set_load 0.000346863  [get_nets n10]
set_load 0.00093231  [get_nets n8]
set_load 0.00219258  [get_nets n9]
set_load 0.00300234  [get_nets n1]
set_load 0.00104643  [get_nets {op[6]}]
set_load 0.0016723  [get_nets {op[5]}]
set_load 0.00251608  [get_nets {op[4]}]
set_load 0.00115098  [get_nets {op[3]}]
set_load 0.00196933  [get_nets {op[2]}]
set_load 0.00221935  [get_nets {op[1]}]
set_load 0.0020111  [get_nets {op[0]}]
set_load 0.00108866  [get_nets {funct[5]}]
set_load 0.00184612  [get_nets {funct[4]}]
set_load 0.00256061  [get_nets {funct[3]}]
set_load 0.00326981  [get_nets {funct[2]}]
set_load 0.00523809  [get_nets {funct[1]}]
set_load 0.00450106  [get_nets {funct[0]}]
set_load 0.0049969  [get_nets {alu_op[1]}]
set_load 0.00499346  [get_nets {alu_op[0]}]
