###################################################################

# Created by write_sdc on Tue Mar 28 12:39:37 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_propagated_clock [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_propagated_clock [get_clocks clk]
set_max_delay 25  -to [get_ports {Q[3]}]
set_max_delay 25  -to [get_ports {Q[2]}]
set_max_delay 25  -to [get_ports {Q[1]}]
set_max_delay 25  -to [get_ports {Q[0]}]
set_load 0.00224462  [get_nets n7]
set_load 0.00111743  [get_nets n26]
set_load 0.00106343  [get_nets N13]
set_load 0.00101896  [get_nets n5]
set_load 0.000988807  [get_nets n4]
set_load 0.0018659  [get_nets n15]
set_load 0.00264693  [get_nets n25]
set_load 0.0019249  [get_nets n3]
set_load 0.000484754  [get_nets n21]
set_load 0.000660331  [get_nets n24]
set_load 0.000607235  [get_nets n22]
set_load 0.000529125  [get_nets n23]
set_load 0.00061382  [get_nets N14]
set_load 0.000732078  [get_nets n12]
set_load 0.000192229  [get_nets n18]
set_load 0.00120566  [get_nets n2]
set_load 0.000462995  [get_nets n20]
set_load 0.000619953  [get_nets n14]
set_load 0.00156667  [get_nets n19]
set_load 0.000161824  [get_nets n16]
set_load 0.00134897  [get_nets n17]
set_load 0.00146486  [get_nets N15]
set_load 0.000254506  [get_nets n13]
set_load 0.00161118  [get_nets n9]
set_load 0.00108849  [get_nets n11]
set_load 0.000444621  [get_nets n1]
set_load 0.000330488  [get_nets n10]
set_load 0.00139236  [get_nets n6]
set_load 0.000736307  [get_nets n8]
set_load 0.000833758  [get_nets N16]
set_load 0.00432917  [get_nets load]
set_load 0.00408767  [get_nets up]
set_load 0.00154637  [get_nets clr]
set_load 2.028e-07  [get_nets clk]
set_resistance 8.66667e-07  [get_nets clk]
set_load 0.00161083  [get_nets {Q[3]}]
set_load 0.00423583  [get_nets {Q[2]}]
set_load 0.00369426  [get_nets {Q[1]}]
set_load 0.00487066  [get_nets {Q[0]}]
set_load 0.00145014  [get_nets {data[3]}]
set_load 0.00174472  [get_nets {data[2]}]
set_load 0.000584253  [get_nets {data[1]}]
set_load 0.00202477  [get_nets {data[0]}]
